<a href="https://colab.research.google.com/github/etlarkin/CS167/blob/main/Day03_exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

An example of a markdown cell<br>
Author: <b>Elizabeth Larkin</b><br>
Date: September 7, 2021
# Python and Pandas Exercises

Before you begin, make sure you download the data from Blackboard and put it in your Google Drive where you know how to find it (preferably in a datasets folder).

In [1]:
#selecting columns in dataframes
import pandas
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
titanic = pandas.read_csv("/content/drive/MyDrive/CS167/Datasets/titanic.csv")
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [3]:
# what is the data type of titanic?
type(titanic)

pandas.core.frame.DataFrame

In [6]:
# what are the features (column titles) of the titanic dataset?
titanic.columns

# how many columns are there
titanic.columns.shape 

# or 

len(titanic.columns)

15

In [8]:
# display only the 'embark_town' column of the titanic data
titanic['embark_town'] #use this one for variables with a space

# or
titanic.embark_town

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [10]:
# what is the data type of the result of the previous cell? 
type(titanic['embark_town'])

pandas.core.series.Series

In [14]:
# what is the "shape" of the data frame?
titanic.shape

(891, 15)

In [17]:
# make a subset (call the variable 'subset') of the data that consists of the last 20 rows of the data;
# verify that your subset has 20 rows
subset= titanic.loc[871:891]

In [20]:
# use loc to print out the data for passenger 890 on the titanic dataframe
titanic.loc[890]
# use iloc to print out the data for passenger 890 on the subest dataframe
print(subset.loc[890])
print(subset.iloc[19])

survived                0
pclass                  3
sex                  male
age                    32
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object
survived                0
pclass                  3
sex                  male
age                    32
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object

In [ ]:
# use a markdown cell; describe the difference between loc and iloc

loc is used with labels, iloc is used with indices

In [24]:
# create a subset of the data (call the variable 'queenstown_subset') that consists only of passengers with
# a 'embark_town' that is "Queenstown"
# hint: if you get a warning, you may need to explicitly note that you are making a copy of the original data by using 
# the .copy() function

queenstown_subset = titanic[titanic['embark_town'] == 'Queenstown']
queenstown_subset.head()

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
5          0       3    male   NaN  ...   NaN   Queenstown     no   True
16         0       3    male   2.0  ...   NaN   Queenstown     no  False
22         1       3  female  15.0  ...   NaN   Queenstown    yes   True
28         1       3  female   NaN  ...   NaN   Queenstown    yes   True
32         1       3  female   NaN  ...   NaN   Queenstown    yes   True

[5 rows x 15 columns]

In [26]:
# how many passengers are in queenstown_subset?
queenstown_subset.shape[0]

77

In [27]:
# what is the average fare for all of those in the queenstown_subset?
queenstown_subset['fare'].mean()

13.276029870129872

In [35]:
# what is the average age for all of those in the queenstown_subset?
queenstown_subset['age'].mean()

# do all of the passengers have an age recorded? What is recorded if there is no age?
queenstown_subset['age'].isnull().any()

True

In [ ]:
# What does unique(), mean(), isnull(), and fillna() do? Use a markdown cell to write your answers
# Use the Pandas documentation (https://pandas.pydata.org/pandas-docs/stable/reference/index.html)

In [ ]:
# give examples of your use of unique(), mean(), median(), isnull()

In [ ]:
# in the queenstown_subet dataframe
# for each row that does not have an age recorded, replace the NaN value with the calculated average
# hint: don't use a loop; it can be done in 1 line of code using fillna()

In [30]:
# load in the iris data
irisData = pandas.read_csv("/content/drive/MyDrive/CS167/Datasets/irisData.csv")
irisData.head()
# what is the median sepal width of just the Setosas?

   sepal length  sepal width  petal length  petal width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [ ]:
# for those iris that are classified as versicolor and have 
# a petal-length > 4, what is the average sepal width?